; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared3 - mode
	image1 - mode
	image5 - mode
	spectrograph0 - mode
	thermograph2 - mode
	spectrograph4 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star7 - direction
	GroundStation6 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph2)
	(supports instrument0 image5)
	(supports instrument0 spectrograph4)
	(supports instrument0 image1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(pointing satellite0 Star8)
	(have_image Star11 infrared3)
	(have_image Star12 spectrograph4)
	(have_image Star13 image1)
	(have_image Star13 infrared3)
	(have_image Planet14 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 planet14 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet14)
   goals met: 0 of 6
3. (turn_to satellite0 star7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 planet14 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet14)
   goals met: 0 of 6
6. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 1 of 6
7. (turn_to satellite0 star11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star11)
   goals met: 1 of 6
8. (take_image satellite0 star11 instrument0 infrared3)
   added: (have_image star11 infrared3)
   goals met: 2 of 6
9. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 2 of 6
10. (take_image satellite0 star12 instrument0 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 3 of 6
11. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 3 of 6
12. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 4 of 6
13. (take_image satellite0 star13 instrument0 infrared3)
   added: (have_image star13 infrared3)
   goals met: 5 of 6
14. (turn_to satellite0 star8 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star8)
   goals met: 6 of 6
